{
    "spells": [
        {
            "name": "Essential Salt",
            "type": "spell",
            "img": "icons/consumables/materials/salt-pile-white.webp",
            "system": {
                "range": "Touch",
                "duration": "Instantaneous",
                "components": "V, S, M (corpse)",
                "description": "You reduce a corpse into a coarse grit that can be stored in a tiny (3 per inventory slot) pouch or vial. You can cast speak with dead to speak with the spirit as many times as you want (normally you are limited to one attempt per corpse). This requires you to spread the salt out on a flat surface; be mindful it doesn't get blown away or mixed in with mundane sand. After several conversations, spirits tend to regain much of their personality."
            }
        },
        {
            "name": "Explode Corpse",
            "type": "spell",
            "img": "icons/magic/death/explosion-skull-energy-green.webp",
            "system": {
                "range": "200'",
                "duration": "Instantaneous",
                "components": "V, S",
                "description": "Target corpse explodes, dealing damage in a [dice]×5' radius, Save for half. The maximum damage dealt is dependent on the creature's size: Rat: 1, Dog: 1d6, Human: 2d6, Cow: 3d6, Elephant: 6d6, Whale: 8d6. This spell cannot target undead creatures unless you control them."
            }
        },
        {
            "name": "Explosion Containment",
            "type": "spell",
            "img": "icons/magic/defensive/shield-barrier-flaming-diamond-orange.webp",
            "system": {
                "range": "Self",
                "duration": "[dice] hours",
                "components": "V, S (reaction)",
                "description": "You may cast this spell as a reaction. Save, with a bonus equal to [sum]. Any incoming damage from an explosion or high-speed impact is stored in the palm of your hand. You also block damage that would be dealt to anything in a cone behind you. You can't use this spell to stop an arrow, a magic missile, or a falling wall, but you can use it to stop a barrel of gunpowder, exploding magical equipment, or a fireball. Before the spell's duration expires, you must release the explosion in a cone aimed from the palm of your hand."
            }
        },
        {
            "name": "Extract Value",
            "type": "spell",
            "img": "icons/commodities/currency/coins-plain-gold.webp",
            "system": {
                "range": "Touch",
                "duration": "Instantaneous",
                "components": "V, S",
                "description": "Obliterate target objects (up to [dice]² cubic feet) into gold coins, equaling their monetary value, and a pile of flammable red dust, equaling the remaining weight."
            }
        },
        {
            "name": "Extract Venom",
            "type": "spell",
            "img": "icons/consumables/potions/bottle-round-corked-poison-green.webp",
            "system": {
                "range": "Touch",
                "duration": "Instantaneous",
                "components": "V, S, M (sharp object)",
                "description": "You pierce a creature with a sharp object and draw all of the venom out, which then pools in your hand or a vial. If you use this to remove the poison from a poisoned creature, that creature gets a new save with a +4 [dice] bonus. You can also use this to draw all of the poison out of a venomous creature. Unwilling venomous creatures get a save. Note that this spell doesn't work on all poisons, just venoms (organic, mechanically delivered poisons, usually from things with fangs or stingers). Most biomancers keep one of their fingernails razor sharp for this purpose."
            }
        },
        {
            "name": "Fade",
            "type": "spell",
            "img": "icons/magic/control/silhouette-hold-change-blue.webp",
            "system": {
                "range": "50'",
                "duration": "[dice] rounds",
                "components": "V, S (splittable)",
                "description": "Target phases out, and becomes unable to affect the world in any way except visually. It just floats there like an illusion until the spell concludes. Not even magic can affect the target. If they would be in a solid object when the spell expires, they are harmlessly shunted into the nearest open space. The maximum size of the object depends on how many dice are invested in the spell: human (1D) / ogre (2D) / dragon (3D) / ship (4D)."
            }
        },
        {
            "name": "Fear",
            "type": "spell",
            "img": "icons/magic/control/fear-fright-white.webp",
            "system": {
                "range": "50'",
                "duration": "[sum] rounds",
                "components": "V, S (splittable)",
                "description": "Terrify everyone. NPCs make a morale check, PCs Save vs Fear."
            }
        },
        {
            "name": "Feather",
            "type": "spell",
            "img": "icons/commodities/materials/feather-white.webp",
            "system": {
                "range": "Touch",
                "duration": "[dice]² rounds",
                "components": "V, S (splittable, reaction)",
                "description": "Object's weight (but not mass) drops by 99%. You can cast this spell on yourself as a reaction (even when it isn't your turn). Most things fall at 60' per round."
            }
        },
        {
            "name": "Fireball",
            "type": "spell",
            "img": "icons/magic/fire/explosion-fireball-medium-orange.webp",
            "system": {
                "range": "200'",
                "duration": "Instantaneous",
                "components": "V, S",
                "description": "Does [sum] fire damage to all objects in 20' diameter. Save for half."
            }
        },
        {
            "name": "Floating Disk",
            "type": "spell",
            "img": "icons/magic/symbols/runes-carved-stone-purple.webp",
            "system": {
                "range": "5'",
                "duration": "[dice] hours",
                "components": "V, S (splittable)",
                "description": "A floating disk springs into existence beside you. It floats 4\" above the floor and never exerts weight on the floor beneath it. It follows you, always within 5' of you. It can go upstairs and across water. Maximum weight is [dice] × 500 lbs. If you stand atop it, you can direct it."
            }
        },
        {
            "name": "Floral Salvage",
            "type": "spell",
            "img": "icons/magic/nature/plant-sprout-flower-pink.webp",
            "system": {
                "range": "Touch",
                "duration": "Instantaneous",
                "components": "V, S (splittable)",
                "description": "Flowers (caster chooses the type) erupt from the target's wounds. Target takes 1 damage for every point of damage it has already taken, not exceeding [sum]×2. Save for half. If this damage kills the target, their corpse is entirely consumed by plant growth, and turns into a beautiful tree covered in flowers. Height is 2d4 × creature's HD in feet."
            }
        },
        {
            "name": "Fool's Gold",
            "type": "spell",
            "img": "icons/commodities/currency/coins-scattered-mix.webp",
            "system": {
                "range": "Touch",
                "duration": "[dice] hours",
                "components": "V, S",
                "description": "Touched object, or heap of objects (weight [sum]×10 lbs.), appears to be gold for the spell's duration. Only alchemy or magic will reveal that it is not truly gold."
            }
        },
        {
            "name": "Grease",
            "type": "spell",
            "img": "icons/magic/water/barrier-ice-crystal-wall-blue.webp",
            "system": {
                "range": "50'",
                "duration": "[dice] ×2 rounds",
                "components": "V, S (splittable)",
                "description": "Can be cast directly on a creature or a 10' × 10' surface. Grease causes held objects to be dropped and moving creatures to fall prone, if a Dex check is failed."
            }
        },
        {
            "name": "Metal Chime",
            "type": "spell",
            "img": "icons/sundries/misc/bell-brass.webp",
            "system": {
                "range": "Touch",
                "duration": "[dice] days",
                "components": "V, S, M (one metal object)",
                "description": "You touch and enchant a piece of metal to make a terrific noise the next time it strikes a solid surface or is struck. All creatures within 100' (except you) must Save or be deafened for [sum] minutes. If used as a signal, it can be heard up to a mile away."
            }
        },
        {
            "name": "Mercury's Haste",
            "type": "spell",
            "img": "icons/magic/movement/trail-streak-impact-blue.webp",
            "system": {
                "range": "Touch",
                "duration": "[sum] rounds",
                "components": "V, S",
                "description": "Target creature's body becomes mercury. Save negates. They can flow through gaps as a liquid, but sink in water. They are immune to piercing damage and reduce all other incoming non-magical damage by 2. They move at 2x normal speed, but cannot jump."
            }
        },
        {
            "name": "Mirror Object",
            "type": "spell",
            "img": "icons/sundries/misc/mirror-hand-steel.webp",
            "system": {
                "range": "Touch",
                "duration": "[dice] hours",
                "components": "V, S, M (mirror)",
                "description": "You reach into a mirror-like surface and pull out a copy of an object adjacent to the mirror. The object that you pull out must be within reach of the mirror (as if it were a window), small enough to fit through the mirror (as if it were a window) and light enough for you to pull through with one hand. The mirror object looks and feels exactly like the object it copied. It doesn't copy magical properties. You cannot duplicate living things this way. The mirror object pops like a bubble if it suffers a solid blow (a mirror sword could be used once then vanishes). If you invest at least 4 dice into this spell, it can copy the magical properties of an item, but those magical properties will only function once for up to [sum] minutes and then the object vanishes."
            }
        },
        {
            "name": "Mirror Self",
            "type": "spell",
            "img": "icons/magic/control/silhouette-hold-change-blue.webp",
            "system": {
                "range": "Touch",
                "duration": "Sustainable",
                "components": "V, S, M (mirror)",
                "description": "You reach into a mirror-like surface and pull out a copy of yourself. The mirror must be large enough for you to pass through. Your mirror clone behaves as you wish. It can walk and talk, but it cannot pick anything up. You can see through its eyes and hear through its ears. You can cast spells through places of your mirror twin as a free action. The mirror twin pops like a bubble if it suffers a solid blow."
            }
        },
        {
            "name": "Monsterize",
            "type": "spell",
            "img": "icons/magic/control/debuff-energy-hold-pink-purple.webp",
            "system": {
                "range": "Touch",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "Target saves or becomes a horrible monster version of itself. Monsters get +1 HD (+4 max HP, +1 to hit, +1 to save). Player characters have their Strength raised to 12. The target flies into a rage, and is incapable of tactics, kindness, or retreat, even if urged by friends."
            }
        },
        {
            "name": "Mutate",
            "type": "spell",
            "img": "icons/magic/nature/mutation-plant-hand.webp",
            "system": {
                "range": "Touch",
                "duration": "Permanent",
                "components": "V, S (splittable)",
                "description": "Target saves or gains random mutation. Roll for a random mutation [dice] times and the caster chooses one from among the options."
            }
        },
        {
            "name": "Olfactory Revelation",
            "type": "spell",
            "img": "icons/magic/perception/nose-sniff-swirl.webp",
            "system": {
                "range": "Self",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "You gain an unbelievable sense of smell. Functions like darkvision up to 60'. New smells are confusing."
            }
        },
        {
            "name": "Pale Transmutation",
            "type": "spell",
            "img": "icons/magic/symbols/runes-carved-stone-yellow.webp",
            "system": {
                "range": "Touch",
                "duration": "Permanent",
                "components": "V, S",
                "description": "True transmutation is impossible. No one's ever been able to do it with magic anyway. But The Pale King got close. Slide your hand over [sum] cubic feet of metal objects. They transmute in the following [dice] ways: [one]: everything, but gold turns to lead [two]: iron turns to glass. It's opaque and fragile. [three]: as [two] and copper and bronze sublimate into a corrosive gas dealing 1d6 damage for [dice] rounds in a 2×[dice]' radius. [four]: as [three] and silver ignites dealing 1d6 damage to anything in contact with it for [dice] rounds."
            }
        },
        {
            "name": "Paper Automaton",
            "type": "spell",
            "img": "icons/sundries/scrolls/scroll-worn-tan.webp",
            "system": {
                "range": "Touch",
                "duration": "[sum] hours",
                "components": "V, S, M (paper)",
                "description": "You enchant a piece of plant-based paper or parchment to obey your commands. The paper folds into a tiny humanoid shape and follows simple instructions. It can lift nothing heavier than a single coin, but it can write and read. It has [dice] HP, Defense 0, and is destroyed at 0 HP, but takes no damage from bludgeoning weapons. The size of the automaton depends on the dice you invest in the spell. mouse (1D) / dog (2D) / person (3D) / elephant (4D)."
            }
        },
        {
            "name": "Prismatic Ray",
            "type": "spell",
            "img": "icons/magic/light/prism-rainbow-colors.webp",
            "system": {
                "range": "200'",
                "duration": "Instantaneous",
                "components": "V, S (splittable)",
                "description": "Target suffers a different effect depending on which color strikes the target. Roll a d10. Red: Target takes [sum] fire damage, save for half. Orange: Target takes [sum] bludgeoning damage and is knocked prone. Save negates. Yellow: Target takes [sum] lightning damage, save for half. Green: Target takes [sum] acid damage, save for half. Blue: Target takes [sum] ice damage, save for half. Purple: Target takes [sum] necrotic damage and is blinded for [sum] rounds. Save negates. Struck twice: Roll a d6 twice. Add effects; make one save. Struck thrice: Roll a d6 three times."
            }
        },
        {
            "name": "Rain of Arrows",
            "type": "spell",
            "img": "icons/weapons/ammunition/arrows-flight-wood.webp",
            "system": {
                "range": "200'",
                "duration": "Instantaneous",
                "components": "V, S, M (arrow)",
                "description": "Does [sum] damage in 20' diameter. As Fireball except that the caster fires an arrow into the air (which turns into a multitude) and the damage is all piercing damage. Doesn't work in places with low ceilings (less than 100')."
            }
        },
        {
            "name": "Raise Skeleton",
            "type": "spell",
            "img": "icons/magic/death/skeleton-robe-scythe-green.webp",
            "system": {
                "range": "20'",
                "duration": "2 hours",
                "components": "V, S, M (corpse)",
                "description": "Target is raised as a skeleton and obedient to the caster. You cannot use this spell on a corpse that has HD greater than 2[dice]. HD as base creature, Def 14, Weapon or Claw 1d6, Move 12, Int 0, Mor 20. Double damage from bludgeoning. This is for a human-sized skeleton. When this spell expires, the undead collapses into dust. If you die while undead are under your control, each undead has an independent 50% chance of going wild and attacking the nearest living thing. This spell consumes the corpse."
            }
        }
    ]
}
