{
    "spells": [
        {
            "name": "Raise Crawling Claw",
            "type": "spell",
            "img": "icons/magic/anatomy/hand-skeleton-glow-red.webp",
            "system": {
                "range": "20'",
                "duration": "2 hours",
                "components": "V, S, M (corpse)",
                "description": "Target is raised as a crawling claw and obedient to the caster. You cannot use this spell on a corpse that has HD greater than 2[dice]. HD 0, Def 12, Claw 1d2 + Choke, Climb 9, Int 5, Mor 20, Stealth 10. Choke – Target is unable to breathe or speak. You know how to carve an eye rune into the crawling claw (1 hour). If you do, you can close your eyes and touch the claw's opposite hand to see through the eye-rune for up to 10 minutes (but you cannot control the crawling claw except verbally). When you stop looking through the rune, the crawling claw disintegrates. This spell consumes the corpse."
            }
        },
        {
            "name": "Raise Skin Kite",
            "type": "spell",
            "img": "icons/magic/death/undead-ghost-scream-teal.webp",
            "system": {
                "range": "20'",
                "duration": "2 hours",
                "components": "V, S, M (corpse)",
                "description": "Target is raised as a skin kite and obedient to the caster. You cannot use this spell on a corpse that has HD greater than 2[dice]. HD as base creature, Def 10, Whip 1d6, Fly 12, Int 5, Mor 20. Carrying capacity: 40 lbs. You can carve a mouth rune into a skin kite (a one-hour process), which allows you to cast a single spell through the skin kite (as if you were the skin kite). You must be able to see both the skin kite and the skin kite's target. After casting a spell through a skin kite, the kite disintegrates. These stats are for a human-sized skin kite. This spell consumes the corpse."
            }
        },
        {
            "name": "Raise Zombie",
            "type": "spell",
            "img": "icons/magic/death/undead-zombie-shamble-green.webp",
            "system": {
                "range": "20'",
                "duration": "2 hours",
                "components": "V, S, M (corpse)",
                "description": "Target is raised as a zombie and obedient to the caster. You cannot use this spell on a corpse that has HD greater than 2[dice]. HD as base creature, HP +50%, Def 10, Slam 1d6, Move 6, Int 0, Mor 20. Zombies that are killed have a 50% chance to regain 1 HP at the start of their next turn; this ability is usable only once but refreshes if the zombie is healed above 1 HP. These stats are for a human-sized zombie. Zombies can fly if the base creature can fly. This spell consumes the corpse."
            }
        },
        {
            "name": "Regenerate",
            "type": "spell",
            "img": "icons/magic/life/heart-cross-strong-flame.webp",
            "system": {
                "range": "Touch",
                "duration": "[dice] hours",
                "components": "V, S",
                "description": "Target regenerates [dice] HP every 10 / [dice] minutes. If a unicorn horn or green troll heart is consumed during the casting, the recipient also regrows all missing limbs and body parts."
            }
        },
        {
            "name": "Revenant",
            "type": "spell",
            "img": "icons/magic/death/undead-ghost-scream-purple.webp",
            "system": {
                "range": "Touch",
                "duration": "[sum] minutes",
                "components": "V, S, M (player character corpse)",
                "description": "A dead PC or hireling immediately returns to life as an undead, exactly as they were when they died (except for new injuries they may have gained in the process of dying). Their HP is [sum], up to their normal maximum HP. You cannot use this spell against any PC who died more than 10 minutes ago. When the duration elapses, the PC disintegrates."
            }
        },
        {
            "name": "Rot",
            "type": "spell",
            "img": "icons/magic/death/skull-horned-goat-pentagram-green.webp",
            "system": {
                "range": "Touch",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "Creatures take [dice]² damage, save for half, and show physical (but not mechanical) signs of aging (white hair, wrinkles, but no loss of strength). Objects are aged according to how many dice are invested: [sum] weeks (1D) / [sum] months (2D) / [sum] years (3D+). Books sprout into mold, wood becomes soggy, lamps run out of fuel and grow cold, and stone is entirely unaffected. Undead are not damaged, and are instead healed for [sum] + [dice] HP."
            }
        },
        {
            "name": "Scry",
            "type": "spell",
            "img": "icons/magic/perception/eye-ringed-glow-angry-small-blue.webp",
            "system": {
                "range": "[dice] × 10'",
                "duration": "Sustainable",
                "components": "V, S, M (scrying focus)",
                "description": "You conjure an invisible sensor to a point in space that you designate. You do not have to have line of sight to cast it. If you can see invisible things, the sensor is a duplicate of your eye. As long as you maintain concentration, you can see through this sensor with your normal senses. This spell requires something to scry on, usually a mirror, quiet pool, clouds, or bonfire. If you invest at least two casting dice, you can also hear through the sensor. If you invest at least three dice, you can also speak through the sensor. If you use an actual crystal ball when casting this spell, the range is instead [dice] miles. Crystal balls are rare enough that they are never offered for sale, but are worth upwards of 3,000c."
            }
        },
        {
            "name": "Serpents of the Earth",
            "type": "spell",
            "img": "icons/creatures/reptiles/snake-fangs-bite-green.webp",
            "system": {
                "range": "Touch",
                "duration": "Sustainable",
                "components": "V, S, M (natural soil or stone)",
                "description": "[Sum] enormous serpents of HD 1d4 crawl up from the dirt. They have Attack +3, Defense +3 and deal 1d6+HD damage, except for the 1 HD serpents, which are small and bite for 1 damage + deadly poison. Serpents are not controlled by you. They're just pissed off snakes."
            }
        },
        {
            "name": "Shrivel",
            "type": "spell",
            "img": "icons/magic/death/skull-energy-light-teal.webp",
            "system": {
                "range": "Touch",
                "duration": "[dice] ×2 rounds*",
                "components": "V, S (splittable)",
                "description": "Target loses half of its current HP and loses [dice] Strength. When the spell ends, the lost HP and Strength return. If the [sum] is greater than 12, the lost HP does not return, and the Strength damage is permanent. The apparent age of the target increases considerably for the duration."
            }
        },
        {
            "name": "Sleep",
            "type": "spell",
            "img": "icons/magic/control/sleep-bubble-purple.webp",
            "system": {
                "range": "50'",
                "duration": "[sum] minutes",
                "components": "V, S (splittable)",
                "description": "Target falls into a magical slumber, and can't be awoken by anything less vigorous than a slap. Non-alert, unaware targets are not allowed a Save. Has no effect on creatures with HD greater than [sum]. If [sum] is at least 4 times the creature's HD, the duration becomes permanent (until slapped) and the creature no longer needs to eat or drink while sleeping."
            }
        },
        {
            "name": "Shadow Betrayal",
            "type": "spell",
            "img": "icons/magic/symbols/runes-star-pentagon-black.webp",
            "system": {
                "range": "Touch",
                "duration": "[sum] rounds",
                "components": "V, S (splittable)",
                "description": "The target takes damage if their shadow is attacked."
            }
        },
        {
            "name": "The Greatest Gambler",
            "type": "spell",
            "img": "icons/sundries/gaming/dice-pair-jeweled.webp",
            "system": {
                "range": "Self",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "You are possessed by the spirit of Amashak the Evergreen, the greatest gambler who ever lived, who was eventually devoured by an alchemical ooze. She is pragmatic, calculating, and flirtatious. Your rolls are now coin flips. Heads is 12. Tails is 2. Ends if you fail to roleplay Amashak."
            }
        },
        {
            "name": "Transform Metal",
            "type": "spell",
            "img": "icons/magic/symbols/runes-carved-stone-yellow.webp",
            "system": {
                "range": "Touch",
                "duration": "Permanent",
                "components": "V, S, M (metal object)",
                "description": "Transform a target metal object however you wish. The size of the affected object and the possible extent of the transformation increases with the number of [dice]: [one] mold a sword-sized object into simple shapes. [two] mold a child-sized object into featureless complex shapes [three] mold a person-sized object into statue-like shapes or break it into multiple large pieces. [four] mold an object the size of an entire wall or floor into many finely machined parts, remove impurities, or shatter it to dust."
            }
        },
        {
            "name": "Spit to Swords",
            "type": "spell",
            "img": "icons/weapons/swords/sword-guard-worn.webp",
            "system": {
                "range": "Self",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "You transform your spit into blades. By spitting into your hand, you can create a light weapon for [dice] minutes. Alternatively, you may spit darts at a creature within 20', dealing 1d6 damage."
            }
        },
        {
            "name": "Speak with Birds",
            "type": "spell",
            "img": "icons/creatures/birds/songbird-flying-blue.webp",
            "system": {
                "range": "Self",
                "duration": "2 × [sum] minutes",
                "components": "V, S",
                "description": "You can talk to a bird, and it can talk back. If there is a party of 3-6 adventurer's moving through the forest nearby, a random songbird has a [sum]×10% chance of knowing where they are and if they're doing anything extra weird. Birds of prey are rarer, but more observant."
            }
        },
        {
            "name": "Speak with Dead",
            "type": "spell",
            "img": "icons/magic/death/skull-horned-goat-pentagram-purple.webp",
            "system": {
                "range": "Touch",
                "duration": "[dice] minutes",
                "components": "V, S, M (corpse)",
                "description": "You can converse freely with any corpse that has an intact jaw. The words of the dead tend to be cryptic and unhelpful, especially if the creature has no reason to help you. You can only converse with each corpse once. Corpses usually don't remember exactly how they died."
            }
        },
        {
            "name": "Spiteful Queen's Gift",
            "type": "spell",
            "img": "icons/magic/fire/explosion-fireball-small-red.webp",
            "system": {
                "range": "Touch",
                "duration": "[dice] hours",
                "components": "V, S, M (object)",
                "description": "The target is imbued with incendiary potency and will explode when touched by anyone but you. Any creature within 5' of the exploding object takes [sum] damage. If the object is not triggered before the duration, the spell expires and the magics harmlessly dissipate. The target objects are likely to be destroyed by the explosion; wooden items have 5-in-6 chance of breaking, iron items 3-in-6 and magic items 1-in-6."
            }
        },
        {
            "name": "Wall of Doors",
            "type": "spell",
            "img": "icons/environment/doors/door-stone-portal-brown.webp",
            "system": {
                "range": "20'",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "You summon a 10' by 10' set of wooden double doors per [dice] arranged in a flat plane. You can orient it however you want. It has [sum] HP. You can control who and what can open the doors."
            }
        },
        {
            "name": "Wall of Earth",
            "type": "spell",
            "img": "icons/magic/earth/barrier-stone-brown.webp",
            "system": {
                "range": "20'",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "You rearrange dirt to form a 10' by 10' panel per [dice]. You can mold the wall, similar to cutting holes and notches in a sheet of paper. The wall has Defense 2 and [dice]×2 HD. If it is horizontal, the wall must be anchored on at least 2 sides."
            }
        },
        {
            "name": "Wall of Fire",
            "type": "spell",
            "img": "icons/magic/fire/barrier-wall-flame-ring-yellow.webp",
            "system": {
                "range": "20'",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "You summon fire to form a 10' by 10' panel per [dice]. You can mold the wall, similar to cutting holes and notches in a sheet of paper. The wall does not block line of sight. It deals 1d6 fire damage to anything that passes through it. Save vs Dex or be set on fire."
            }
        },
        {
            "name": "Wall of Light",
            "type": "spell",
            "img": "icons/magic/light/barrier-wall-blue.webp",
            "system": {
                "range": "20'",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "You conjure either (a) a hemisphere that is 5' in diameter for every invested casting die, or (b) a 10' by 10' panel for every invested casting die, which can be arranged in any contiguous formation joined by their edges. For example, three casting dice would allow you to build a 10' by 30' wall. The wall is intangible, but you can control what each side shows. It can be either (a) inky darkness, (b) light out to 30', (c) mirror, or (d) transparency. Both sides do not have to show the same thing, so one side could show a mirror surface while the other can be seen through. You can change these surfaces with a thought."
            }
        },
        {
            "name": "Wall of Wind",
            "type": "spell",
            "img": "icons/magic/air/wind-tornado-wall-blue.webp",
            "system": {
                "range": "20'",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "You summon wind to form a 10' by 10' panel per [dice]. You can mold the wall, similar to cutting holes and notches in a sheet of paper. The wall does not block line of sight. Powerful winds will knock small projectiles out of the air and prevent vermin (anything smaller than a rat) from crossing. Ranged attacks that pass through the wall get a -[dice] penalty to hit."
            }
        },
        {
            "name": "Wave of Mutilation",
            "type": "spell",
            "img": "icons/magic/air/wind-tornado-funnel-blue.webp",
            "system": {
                "range": "30' cone",
                "duration": "Instantaneous",
                "components": "V, S",
                "description": "Everything in a 30' cone takes [sum] slashing damage. This spell leaves dozens of deep cuts. It shreds clothing, paper, and other fragile items."
            }
        },
        {
            "name": "Trapdoor Monster",
            "type": "spell",
            "img": "icons/creatures/arachnids/spider-giant-brown.webp",
            "system": {
                "range": "50'",
                "duration": "[dice] varies",
                "components": "V, S",
                "description": "A gigantic trapdoor spider appears beneath a solid surface within 10' of a point you designate. The exact position of the perfectly camouflaged trap door isn't know to you or anyone else. The spider will attack the nearest creature smaller than it or of approximately equal size. It owes you nothing and is not friendly. The size, HD, and damage of the spider depends on the [sum] rolled. 1-7: person-sized, 2 HD, 2d6 damage 8-12: ogre-sized, 4 HD, 3d6 damage 13-17: cottage-sized, 6 HD, 4d6 damage 18+: house-sized, 10 HD, 6d6 damage. Creatures reduced to 0 HP are dragged into the spider's lair. If you invest 4 [dice] the spider will avoid harming you or your allies while hunting and eating its prey before attacking again. Otherwise, it vanishes after attacking once."
            }
        },
        {
            "name": "Wizard Vision",
            "type": "spell",
            "img": "icons/magic/perception/eye-ringed-glow-angry-large-red.webp",
            "system": {
                "range": "Self",
                "duration": "[sum] minutes",
                "components": "V, S",
                "description": "One [dice]: You can see invisible things. You can see through illusions. Non-magical disguises (such as the ones assassins use) are not penetrated. Two dice: As above, except you can see through magical darkness, and see the true forms of shapeshifters. Three dice: There are also some permanent effects: You can forever see invisible things as a slight warping or lensing of light. You know \"there's something over there\" and what size it roughly is, but nothing else. You can tell someone is a spellcaster by looking them in the eyes. The price for this gift is your mind. It is difficult for the human brain to stare at all the etheropelagic lifeforms that surround us, and all the unseen angles of parallel universes. You suffer a permanent loss of 1d6 Wisdom (as you reject the impossible reality you are looking at, and go a tiny bit insane) or 1d6 Charisma (as you accept this transcendental truth and become forever alienated from your fellow humans, who will never understand the truth). (Werewolves are both wolf and human, and appear as a wolf through your left eye and a human through your right eye. Doppelgangers have no true form and appear as a roiling mass of all the people they've been before.)"
            }
        }
    ]
}
